change style architectur
